Revit 2020 API
Document.Link Method
Overload List
Name | Description
Link(String, DWFImportOptions)
 Links Markups in a DWF file to the document.
Link(String, SATImportOptions, View)
 Links an SAT file into the document.
Link(String, SKPImportOptions, View)
 Links an SKP file into the document.
Link(String, DGNImportOptions, View, ElementId)
 Links a DGN file to the document.
Link(String, DWGImportOptions, View, ElementId)
 Links a DWG or DXF file to the document.
See Also
Document Class
Document Members
Autodesk.Revit.DB Namespace